D.race = ["human", "elvin", "deamon", "wolves", "drawf", "goblin", "catvinx", "centaur", "orc", "titan", "dracon"];

D.base = {
	health: "健康",
	stamina: "体力",
	sanity: "理智",

	hydration: "水分",
	nutrient: "营养",
	dirty: "污迹",

	alcohol: "酒精",
	stress: "压力",
};

D.palam = {
	ecstacy: "快感", //判定射精（有丁）or潮吹（无丁）。

	//受方palam
	arousal: "欲情", //欲望值，根据累积flag升级欲望lv。指令执行成功时概率获得依存值。
	surrend: "屈从", //根据累积flag升级顺从Lv。屈从palamlv累计到一定值时获得刻印。指令执行成功时概率获得服从值/支配值。
	fear: "恐惧", //恐惧刻印
	mortify: "羞耻", //羞耻刻印。露出类指令。
	humiliate: "受辱", //耻辱刻印。 羞辱类指令
	pain: "疼痛", //痛苦刻印
	depress: "抑郁", //压力值
	resist: "抵触", //反抗刻印
	favo: "好意", //好感转换
	uncomfort: "不适", //减少mood，根据情况转换为疼痛,抵触,压抑。影响体力与健康的消耗。可能触发生病flag

	//攻方palam
	eager: "渴望", //行为时间拉长，动作变急切。依存up
	angry: "愤怒", //mood down，动作会变粗暴。
	satisfy: "满意", //评价up 好感up
	superior: "优越", // 支配度up

	//部位palam。各种高潮判定主要看这边。高潮时获得性依存度，快乐刻印
	esM: "快M",
	esB: "快B", //同时也是喷乳判定条
	esC: "快C",
	esU: "快U",
	esV: "快V",
	esA: "快A",
	esW: "快W",

	//各部位疼痛值。抖M会转化为部位快感。否则抵消部分快感。总值算入pain中。
	paM: "痛M",
	paB: "痛B",
	paC: "痛C",
	paU: "痛U",
	paV: "痛V",
	paA: "痛A",
};

D.basecolor = {
	health: [255, 92, 79],
	stamina: [223, 236, 15],
	sanity: [12, 163, 238],
	//mana: [160, 35, 231],

	hydration: [65, 255, 233],
	nutrient: [134, 255, 79],

	ecstacy: [255, 95, 202],
	esM: [255, 95, 202],
	esB: [255, 95, 202],
	esC: [255, 95, 202],
	esU: [255, 95, 202],
	esV: [255, 95, 202],
	esA: [255, 95, 202],
	esW: [255, 95, 202],

	pain: [87, 29, 243],
	paM: [87, 29, 243],
	paB: [87, 29, 243],
	paC: [87, 29, 243],
	paU: [87, 29, 243],
	paV: [87, 29, 243],
	paA: [87, 29, 243],
};

D.mark = {
	hypno: ["催眠刻印", "Hypnosis Mark"],
	ecstacy: ["快乐刻印", "Ecstacy Mark"], //the ecstacy ethed on mind
	surrend: ["屈服刻印", "Surrender Mark"],
	pain: ["痛苦刻印", "Pain Mark"],
	fear: ["恐惧刻印", "Fear Mark"],
	humiliate: ["耻辱刻印", "Humiliated Mark"],
	mortify: ["羞耻刻印", "Mortify Mark"],
	resist: ["反抗刻印", "Resistance Mark"],
};

D.stats = ["ATK", "DEF", "MTK", "MDF", "STR", "CON", "DEX", "INT", "WIL", "PSY", "ALR", "LUK"];

D.abl = {
	//max 20
	magica: "魔法等级", //影响魔法技能上限
	lumen: "光魔法",
	ark: "暗魔法",
	flare: "火魔法",
	ions: "水魔法",
	vitae: "木魔法",
	terra: "土魔法",
	electron: "电魔法",
	//-----
	sword: "剑术",
	wrestle: "格斗",
	//-----
	cooking: "料理",
	plant: "种植",
	medicine: "药物",
	craft: "制作",
	fishing: "钓鱼",
	gathering: "采集",
	sing: "歌唱",
	dance: "舞蹈",
	instrument: "乐器",
	painting: "绘画",
};

D.sbl = {
	//max 12, sens max 20
	knowledge: "性知识",
	technique: "性技巧",
	Hskill: "指技",
	Mskill: "舌技",
	VAskill: "腰技",
	Bskill: "魔乳",
	Fskill: "足技",
	endurance: "性耐性",
	submissive: "顺从",
	refuse: "抗拒", //影响指令执行与心理数值,素质的获得
	hypnosis: "催眠",
	desire: "欲望",
	service: "侍奉欲望",
	exhibition: "露出癖",
	promscuity: "滥交",
	masturbationaddic: "自慰成瘾",
	ejectsemenaddic: "射精中毒",
	ejectmilkaddic: "喷乳中毒",
	semenaddic: "精液中毒",
	drugaddic: "药物成瘾",
	sadist: "施虐",
	masochist: "受虐",
	drinksemenaddic: "饮精中毒",
	vagiejac: "内射中毒",
	analejac: "肛射中毒",
	deviancy: "兽奸中毒",
	gangbang: "轮奸中毒",
	tentacles: "触手中毒",
	pregnantdic: "受孕中毒",
};

D.exp = [
	"M",
	"B",
	"C",
	"U",
	"V",
	"A",
	"W",
	"M高潮",
	"B高潮",
	"C高潮",
	"U高潮",
	"V高潮",
	"A高潮",
	"W高潮",
	"高潮",
	"强烈高潮",
	"深度强烈高潮",
	"多重高潮",
	"多穴插入",
	"接吻",
	"射精",
	"喷乳",
	"饮精",
	"肛交",
	"性交",
	"乳交",
	"口交",
	"内射",
	"肛射",
	"乳头开发",
	"后穴开发",
	"尿道开发",
	"子宫开发",
	"触手",
	"精液",
	"精液灌肠",
	"子宫灌精",
	"精液浴",

	"受缚",
	"灌肠",
	"排泄",
	"药物",
	"放尿",

	"插入",
	"道具",
	"施虐",
	"受虐",
	"露出",
	"被拍摄",
	"怀孕",
	"出产",
	"产卵",
	"轮奸",
	"兽奸",

	"眠奸",
	"强奸",
	"迷奸",
	"性转",
	"同性",
	"爱情",
	"侍奉",
	"自慰",
	"药物",
	"服从",
	"催眠",
	"调教",
	"卖春",
];

D.equip = {
	//weapon: "武器",
	//shield: "护盾",

	head: "头饰",
	cover: "外套",
	outfitUp: "上衣",
	outfitBt: "下衣",
	innerUp: "内衣",
	innerBt: "内裤",
	hands: "手套",
	legs: "袜子",

	face: "面具",
	nake: "颈饰",
	ears: "耳饰",
	chest: "乳饰", //乳环,跳弹
	bottom: "插件", //跳弹,肛塞,震动棒
};

D.virginity = ["kiss", "oral", "penis", "anal", "analsex", "vigina", "viginasex", "handholding", "footjob"];

//战斗技能。 战斗中使用。
D.skill = {
	fire_ball: "火球术",
	light_shower: "光雨",
	magica_shield: "魔力屏障",
	green_grow: "生长术",
	lightning: "闪电",
	fire_sowrd: "火焰剑",
	dark_cage: "黑暗牢笼",
	clear_mind: "清心咒",
	water_bubble: "水球术",
	ice_arrow: "冰箭术",
	clean_body: "净身咒",
	object_control: "念动术",
};

D.liquidtype = ["juice", "cum", "rub", "slime", "nectar"];

//string[]管理，用has检测。方便对应多个状态。
//事件判定用, 临时计时器在tsv. 长期计时器在flag
D.state = [
	"睡眠", //睡觉时，受到一定刺激可能会醒来。
	"疲劳", //体力低于5% 并持续 3小时
	"生病", //健康低于80% 并持续 5天
	//"缺魔", //魔力低于10% 并持续 3天
	"失眠", //连续三天不睡觉
	"欲求不满", //欲求(flag值) 大于80%
	"营养不良", //营养低于30% 并持续 2天
	//"缺水", //水分低于 10%并持续 2小时
	"晕厥", //体力与理智低于5% 持续五小时，或双双归零后会晕厥过去。受强烈刺激可能醒来。
	"昏睡", //药物效果。药效散之前绝对不会醒来。虽然无知觉但身体依然有反应。

	"发情", //周期 or 药物
	"抑郁", //压力到达上限 100%
	"精神崩溃", // 压力达到上限 200%
	"梦魇", // 高压力状态睡觉概率触发
	"毒瘾发作", // 药隐Lv2后, 断药计时器到达阈值
	"精瘾发作", // 精瘾Lv2后, 禁断计时器到达阈值
	"寸止", // 允许快感超过上限, 解除时获得强高潮
	"性兴奋", // 欲情超过上限时

	"失明", //看不到, 长久状态, 影响指令
	"失聪", //听不到
	"失声", //不能说
	"石化", //全身无法动弹
	"口球", //装备效果, 不能说
	"眼罩", //不能看
	"束缚", //动弹不得
	"怀孕",
	"肠内受孕",
	"寄生",
	"中毒", //中毒计时器作用期间,健康持续减少
];

D.Psize = [
	[60, 15], //0，微型
	[90, 22], //1, 迷你
	[120, 32], //2, 短小
	[140, 42], //3, 普通
	[160, 52], //4, 大
	[180, 62], //5, 巨大
	[210, 74], //6, 马屌
	[250, 86], //7, 龙根
];

D.mutant = ["光滑", "吸盘", "口器", "隆起", "针", "软刺", "阴茎"];

D.actAbleParts = ["handR", "handL", "mouth", "penis", "vagina", "anal", "foot"];

D.selectAbleParts = ["breast", "clitoris", "urin", "ears", "neck", "butts", "nipple", "thighs", "abdomen"].concat(
	D.actAbleParts
);

D.RandomName = {
	西式: {
		male: [
			"佐尔曼",
			"伊格尔",
			"卡尔顿",
			"杰伊",
			"维里",
			"欧文",
			"坦普尔",
			"南斯",
			"米菲尔",
			"洛克兹",
			"墨切尔",
			"络迦",
			"逖斯",
		],
		female: [
			"亚莉克希亚",
			"爱丽丝",
			"爱玛",
			"阿尔娃",
			"阿曼达",
			"阿蜜莉雅",
			"艾咪",
			"安娜塔西雅",
			"安德莉亚",
			"安琪拉",
			"安妮",
			"安娜贝儿",
			"安东妮儿",
			"艾谱莉",
			"艾琳娜",
			"艾丝翠得",
			"芭芭拉",
			"碧翠丝",
			"贝拉",
			"柏妮丝",
			"布兰琪",
			"凯瑟琳",
			"凯丝",
			"塞西莉亚",
			"莎莉丝特",
			"克莱拉",
			"柯拉",
			"黛儿",
			"黛娜",
			"黛芙妮",
			"迪丽雅",
			"丹尼丝",
			"黛安娜",
			"黛娜",
			"多洛莉丝",
			"尔莎",
			"伊甸",
			"艾尔玛",
			"爱尔莎",
			"艾西",
			"艾琳",
			"艾丝特",
			"艾瑟儿",
			"尤朵拉",
			"尤妮丝",
			"伊文捷琳",
			"伊芙",
			"伊芙琳",
			"费滋",
			"梵妮",
			"费怡",
			"弗罗拉",
			"弗罗伦丝",
			"法兰西斯",
			"弗莉达",
			"菲蕾德翠卡",
			"嘉比里拉",
			"盖尔",
			"姬玛",
			"珍妮芙",
			"葛瑞丝",
			"汉娜",
			"哈莉特",
			"海柔尔",
			"海洛伊丝",
			"何蒙莎",
			"希尔达",
			"希拉瑞莉",
			"汉妮",
			"胡达",
			"艾达",
			"艾娜",
			"英格丽",
			"艾琳",
			"婕咪",
			"珍",
			"珍妮特",
			"珍尼丝",
			"琴",
			"姬儿",
			"朱蒂",
			"朱丽亚",
			"凯伦",
			"凯瑟琳",
			"凯伊",
			"萝瑞尔",
			"萝伦",
			"丽莲",
			"琳达",
			"琳赛",
			"露西",
			"莉蒂亚",
			"梅蜜",
			"曼蒂",
			"玛西亚",
			"玛格丽特",
			"玛丽亚",
			"茉莉",
			"莫妮卡",
			"诺拉",
			"诺玛",
			"诺维雅",
			"妮蒂亚",
			"奥克塔薇尔",
			"蓓姬",
			"潘蜜拉",
			"潘朵拉",
			"派翠西亚",
			"普莉玛",
			"普鲁登斯",
			"昆娜",
			"昆蒂娜",
			"瑞琪儿",
			"瑞伊",
			"丽蓓卡",
			"蕾佳娜",
			"露比",
			"露丝",
			"莎碧娜",
			"莎莉",
			"莎柏琳娜",
			"莎洛姆",
			"莎曼撤",
			"雪莉",
			"雪丽",
			"希贝儿",
			"泰贝莎",
			"泰蜜",
			"泰瑞莎",
			"泰丝",
			"席拉",
			"泰丽莎",
			"蒂芙妮",
			"蒂娜",
			"瓦妮莎",
			"维纳斯",
			"维拉",
			"维娜",
			"维隆卡",
			"旺妲",
			"温蒂",
			"温妮费德",
			"温妮",
			"桑席",
			"赛薇亚拉",
			"芝妮雅",
			"耶达",
			"若伊",
			"若娜",
		],
	},
	和风: {
		male: [
			// '米仓','黑川','唐泽','福山','前田','工藤',
			// '山下','石田','锦户','椎名','仲间','二宫',
			// '加藤','广末','绫濑','冈田','酒井','石黑',
			// '江口','香取','上野','中居','岸谷','木村',
			// '铃木','今井','城田','麻生','白石','柴崎',
			// '松山','北乃','野泽','土屋','伊藤','永山',
			// '寺岛','平宫','藤原','荣仓','原田','泷泽',
			"俊介",
			"葵",
			"柊",
			"慧",
			"和树",
			"拓哉",
			"雄大",
			"彻",
			"优人",
			"晴",
			"瑛太",
			"寛太",
			"拓実",
			"拓真",
			"健",
			"启太",
			"一辉",
			"优斗",
			"干太",
			"海斗",
			"优辉",
			"伊织",
			"阳希",
			"翔大",
			"拓海",
			"飒太",
			"凛",
			"庆太",
			"悠斗",
			"隼人",
			"大介",
			"悠希",
			"俊辅",
			"拓也",
			"圭太",
			"裕太",
			"日向",
			"悠真",
			"阳生",
			"达也",
			"大贵",
			"谅太",
			"一郎",
			"骏",
			"奏太",
			"翼",
			"优汰",
			"空",
		],
		female: [
			"愛",
			"愛子",
			"愛奈",
			"葵",
			"茜",
			"亜希子",
			"麻美",
			"明日香",
			"阿澄",
			"温子",
			"敦美",
			"亜矢子",
			"絢子",
			"綾子",
			"彩子",
			"苑子",
			"亜里沙",
			"亜紀",
			"秋",
			"育恵",
			"郁恵",
			"郁江",
			"育子",
			"伊久美",
			"泉",
			"泉美",
			"小泉",
			"宇野",
			"舞",
			"麻衣",
			"舞子",
			"真希",
			"真紀",
			"真樹",
			"睦子",
			"睦美",
			"明",
			"恵",
			"萌",
			"元子",
			"素子",
			"桃",
			"桃恵",
			"百恵",
			"百枝",
			"利英",
			"利恵",
			"利枝",
			"理絵",
			"理恵",
			"利香",
			"理香",
			"里香",
			"里沙",
			"里紗",
			"利津子",
			"涼子",
			"亮子",
			"琳",
			"鈴",
			"瑠美",
			"留美子",
			"琉璃子",
			"鈴",
			"令子",
			"冷子",
			"励子",
			"怜子",
			"若子",
			"稚子",
			"和佳子",
			"和歌子",
			"和香子",
			"若菜",
			"若葉",
			"雪",
			"有紀",
			"由紀",
		],
	},
};
D.RandomColor = ["红色", "蓝色", "黄色", "绿色", "青色", "紫色", "金色", "银色", "白色", "黑色", "灰色"];
D.RandomHairstyle = {
	male: ["寸头", "短发", "散发", "蘑菇头"],
	female: ["短发", "直发", "马尾", "卷发", "双马尾", "散发"],
};

D.gameStartBouns = {
	启动资金: {
		des: "初始获得一笔钱。",
	},
	魅惑: {
		des: "调教指令更容易执行。",
	},
};
D.gameStartBounsKeys = Object.keys(D.gameStartBouns);
