if (window.Com) {
	//-------------------------------------------------------------------
	//
	//  Command Setup
	//
	//-------------------------------------------------------------------

	//set the filters and types of the command

	S.ComFilterGeneral = ["常规", "挑逗", "魔法", "其他"];
	S.ComFilterTrain = ["前戏", "道具", "性交", "尿道", "SM", "鬼畜", "触手", "情景"];

	//concat the category
	S.ComTypes = S.ComFilterGeneral.concat(S.ComFilterTrain);

	//-------------------------------------------------------------------
	//
	//-------------------------------------------------------------------
}
